cjeeks/MCU-Development/STM32F407实验开发平台/02_程序/B实验/实验5 Ucosii(2.86)+ucgui(3.90a)+ucgui_demo实验/User/main.c
/**
  ******************************************************************************
  * @file    GPIO/IOToggle/main.c 
  * @author  MCD Application Team
  * @version V1.0.1
  * @date    13-April-2012
  * @brief   Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx.h"
#include "ucos_ii.h"
#include <stdio.h>
#include "Gpio.h"
#include "gui.h"
#include "Systick.h"
#include "LedTest.h"
#include "WM.h"
#include "BUTTON.h"


#define STARTUP_TASK_PRIO              1
#define STARTUP_TASK_STK_SIZE          80
#define TOUCHTASK_PRIO                 10
#define TOUCHTASK_STK_SIZE             1000
#define LED_TASK_PRIO                  5
#define LED_TASK_STK_SIZE              5000


static void LedTask(void *p_arg);
static void TouchTask(void *p_arg);

static OS_STK starup_task_stk[STARTUP_TASK_STK_SIZE];
static OS_STK ledtask_stk[LED_TASK_STK_SIZE];
static OS_STK touchtask_stk[TOUCHTASK_STK_SIZE];

static void startup_task(void *p_arg)
{
    systick_init();
//#if(OS_TASK_STAT_EN > 0)
//    OSStatInit();
//#endif
//    
    OSTaskCreate(LedTask,(void*)0,&ledtask_stk[LED_TASK_STK_SIZE - 1],LED_TASK_PRIO);
    OSTaskCreate(TouchTask,(void*)0,&touchtask_stk[TOUCHTASK_STK_SIZE - 1],TOUCHTASK_PRIO);
//    BSP_Init();
//    Task_Start();

    OSTaskDel(OS_PRIO_SELF);
}


int main(void)
{
    OSInit();
    OSTaskCreate(startup_task,(void*)0,&starup_task_stk[STARTUP_TASK_STK_SIZE - 1],STARTUP_TASK_PRIO);
    OSStart();
    return 0;
}


static void LedTask(void *p_arg)
{
    (void)p_arg;
	GUI_Init();
	while(1) 
	{
	    GUIDEMO_main();
	}
}

static void TouchTask(void *p_arg)
{
	u8 tick=0;
	(void)p_arg;
    LEDGpio_Init();
	while(1) 
	{
		tick++;
		OSTimeDly(10); 
		GUI_TOUCH_Exec(); 
		if(tick&0x10)
		{
			LED1_ONOFF(Bit_RESET);
		}
		else
		{
			LED1_ONOFF(Bit_SET);
		}
	}
}

#ifdef  USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif
